# Напишите программу с использованием вложенных циклов for, которая создает таблицу умножения от 1 до 10 и выводит ее.
for i in range(1, 11):
    print()
    for j in range(1, 11):
        print((f"{i} * {j} = {i * j}"))

print("___________")

# Используя вложенные циклы for, напишите программу, которая выводит все комбинации карт из колоды карт для игры в покер
# (масть: "♠", "♣", "♦", "♥"; ранг: "2", "3", "4", "5", "6", "7", "8", "9", "10", "J", "Q", "K", "A").
# Выведите каждую комбинацию в отдельной строке.
Mast = ["♠", "♣", "♦", "♥"]
Rank = ["2", "3", "4", "5", "6", "7", "8", "9", "10", "J", "Q", "K", "A"]
for i in (Mast):
    for j in (Rank):
        print(i + j)